{"pages":[],"posts":[{"title":"初投稿！！","text":"こんにちは、Yuuukiです。 私はブログを通して日々の学びのアウトプットを行うことや日常の出来事を発信すること等を目的にブログを開設しました。私は現在 web 系のことを勉強している京都の大学二回生です。 この記事では、このブログの目的・目標について書いていきます。 目的・web 系の勉強を通して学んだことをアウトプットすること。・日常の出来事や私の持つ意見・考えを発信すること（また、そのことを通して文章力を身に着けること） 等があります。 目標・アウトプットを通して、自分の学びを深めること・文章力を身に着けること 等があります。 このブログを通して、私自身はもちろんのこと読者のあなたも成長できるように頑張りたいです！ それでは、また次回","link":"/myBlog/2020/08/28/%E5%88%9D%E6%8A%95%E7%A8%BF%EF%BC%81%EF%BC%81/"},{"title":"GETとPOSTの違い","text":"こんにちは、Yuuukiです。この記事では、GET と POST について述べていこうと思います。 目次 はじめに HTTP（Hyper Text Transfer Protocol）とは GET メソッド POST メソッド 特徴まとめ ひとこと 参考 はじめに&emsp;みなさんは web について学習していると GET/POST という言葉をよく目にしませんか？（私もよく目にしました。）この記事では、 HTTP とは何か、またそのメソッドである GET/POST とは何かについて説明します。&emsp;いずれの事柄も web 開発を行う上で理解しておかなければならない内容であるため、この記事を読んで大まかに理解できるようにしましょう。 HTTP（Hyper Text Transfer Protocol）とは &emsp; HTTPとは、（Hyper Text Transfer Protocol）の略であり、大まかにいうと、サーバ・クライアント間で通信をするときの規約のことです。みなさん（=クライアント）が web ページを見るために、web ブラウザに URL を入力すると、web サーバに対して、リクエスト（=要求）が送られます。その後、そのリクエストに応じて、web サーバがレスポンスを返します。 このような過程を経て、web ページがみなさんの PC に表示されます。このとき、用いられる通信のルールが HTTP です。 GET メソッド &emsp;GET メソッドは、上記の HTTP メソッドのひとつで、データを取得するときに利用されるものです。このメソッドは、「いつ,、どこからアクセスしても同じ結果が返される」（＝冪等である）ものです。そのため、GET はアクセスの基本と考えてもよいでしょう。 また、このメソッドはデータを送信する際に URL にデータを付与するため、情報が丸見えになってしまうという特徴があります。 例）/get_form.html?userName=Yuuuki&age=20 （↑ これってパスワード・個人情報を送信するとき、恐いですよね……汗） POST メソッド &emsp;POST メソッドも、上記の HTTP メソッドのひとつです。このメソッドは、送信フォームなどで利用される方式で、データを登録・削除したいときに利用されます。 &emsp;POST は GET とは違い、クライアントが行うアクセスの時々で異なる（＝冪等でない）結果が返されます。 また、このメソッドはデータを送信する際に、HTTP リクエストのボディ部分にデータが埋め込まれるため、GET のようにデータが URL を通して見られることがありません。 特徴まとめ&emsp;GET と POST の特徴を簡単にまとめると以下のようになります。GETデータの読み取りに利用され、冪等である。POSTデータの登録・削除などデータの変更に利用され、冪等でない。 ひとこと&emsp;説明文で「冪等」って言葉使ったけど、この熟語は「べきとう」って読んで、「ある操作を 1 回行っても複数回行っても結果が同じであること」っていう意味らしいよ。（Wikipedia より） 参考 GET と POST の違いについて HTTP メソッド GET と POST の違い","link":"/myBlog/2020/08/29/GET%E3%81%A8POST%E3%81%AE%E9%81%95%E3%81%84/"}],"tags":[{"name":"通信技術","slug":"通信技術","link":"/myBlog/tags/%E9%80%9A%E4%BF%A1%E6%8A%80%E8%A1%93/"}],"categories":[{"name":"通信技術","slug":"通信技術","link":"/myBlog/categories/%E9%80%9A%E4%BF%A1%E6%8A%80%E8%A1%93/"}]}